app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE (entry.category='First Entry')
SELECT "entries".* FROM "entries"
---
  def index
    if !params[:category].blank?
      @entries = Entry.where('category=?', params[:category])
    elsif !params[:search].blank?
      @entries = Entry.search params[:search]

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @entry = Entry.find(params[:id])

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @entry = Entry.find(params[:id])

INSERT INTO "entries" ("category", "created_at", "entry_content", "entry_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category", nil], ["created_at", Tue, 18 Dec 2012 21:50:18 UTC +00:00], ["entry_content", nil], ["entry_name", nil], ["updated_at", Tue, 18 Dec 2012 21:50:18 UTC +00:00]]
---
  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "entries" SET "category" = 'First Entry', "updated_at" = '2012-12-18 20:41:01.218741' WHERE "entries"."id" = 1
---
  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 3]]
---
  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy