app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT "todos".* FROM "todos"

  def show
    @todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @todo = Todo.new(params[:todo])

    #respond_to do |format|
      if @todo.save
        #format.html { redirect_to(@todo) }
        #format.js
        @todos = Todo.all
---
INSERT INTO "todos" ("created_at", "item", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Dec 2012 15:16:07 UTC +00:00], ["item", "First Item"], ["updated_at", Tue, 18 Dec 2012 15:16:07 UTC +00:00]]
SELECT "todos".* FROM "todos"

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 7]]